gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/source/pca9420.c
/*
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_debug_console.h"
#include "board.h"
#include "fsl_pca9420.h"
#include "app.h"
#include "fsl_power.h"
#include "pmic_support.h"
#include "pmic_pca9422.h"
#include "ktd202x_leds.h"
#include "elan_ewd608.h"
#include "bq256xx_charger.h"
#include "glf70583.h"
#include "aw88166.h"

#include "fsl_dma.h"
#include "fsl_i2s.h"
#include "fsl_i2s_dma.h"
#include "music.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define PCA9420_LAST_REG (PCA9420_MODECFG_3_3)


#define LED_ENABLE 1
#define PMIC_PCA9422_ENABLE 1
#define TOUCH_ENABLE 0
#define CHARGER_ENABLE 0
#define PMIC_GLF70583_ENABLE 1
#define AMP_ENABLE 0
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
static pca9420_handle_t pca9420Handle;
static volatile bool pca9420IntFlag;
static uint8_t buffer[PCA9420_LAST_REG + 1];

volatile bool g_PIO0_28_Flag = false;
volatile bool g_PIO0_29_Flag = false;



static dma_handle_t s_DmaTxHandle;
static i2s_config_t s_TxConfig;
static i2s_dma_handle_t s_TxHandle;
static i2s_transfer_t s_TxTransfer;

/*******************************************************************************
 * Code
 ******************************************************************************/
static void TxCallback(I2S_Type *base, i2s_dma_handle_t *handle, status_t completionStatus, void *userData)
{
    /* Enqueue the same original buffer all over again */
    i2s_transfer_t *transfer = (i2s_transfer_t *)userData;
    I2S_TxTransferSendDMA(base, handle, *transfer);
}

static void StopSoundPlayback(void)
{
    PRINTF("[I2S1]Stopping sound playback\r\n");

    close_aw88166_pa(AW_DEV_0);

    I2S_TransferAbortDMA(DEMO_I2S_TX, &s_TxHandle);


}

static void StartSoundPlayback(void)
{
    PRINTF("[I2S1]Setup looping playback of sine wave\r\n");

    s_TxTransfer.data     = &g_Music[0];
    s_TxTransfer.dataSize = sizeof(g_Music);

    I2S_TxTransferCreateHandleDMA(DEMO_I2S_TX, &s_TxHandle, &s_DmaTxHandle, TxCallback, (void *)&s_TxTransfer);
    /* need to queue two transmit buffers so when the first one
     * finishes transfer, the other immediatelly starts */
    I2S_TxTransferSendDMA(DEMO_I2S_TX, &s_TxHandle, s_TxTransfer);
    I2S_TxTransferSendDMA(DEMO_I2S_TX, &s_TxHandle, s_TxTransfer);

    start_aw88166_pa(AW_DEV_0, "Music");

}

void GPIO_INTA_DriverIRQHandler(void)
{

	uint32_t status = GPIO_PortGetInterruptStatus(GPIO, 0, kGPIO_InterruptA);


    if (status & (1 << 28)) {
        // 關閉中斷，避免重入
        GPIO_PinDisableInterrupt(GPIO, PIO0_28_PORT, PIO0_28_PIN, kGPIO_InterruptA);

        // PIO0_28 觸發中斷，清除中斷旗標
        GPIO_PinClearInterruptFlag(GPIO, PIO0_28_PORT, PIO0_28_PIN, kGPIO_InterruptA);

        // 執行對應處理
        g_PIO0_28_Flag = true;
        //PRINTF("[Debug] TOUCH_GPIO_INTA_IRQHandler \r\n");
    }
    if (status & (1 << 29)) {

    	GPIO_PinDisableInterrupt(GPIO, PIO0_29_PORT, PIO0_29_PIN, kGPIO_InterruptA);
        GPIO_PinClearInterruptFlag(GPIO, PIO0_29_PORT, PIO0_29_PIN, kGPIO_InterruptA);
        g_PIO0_29_Flag = true;
        //PRINTF("[Debug] PIO0_29_INTA_IRQHandler \r\n");
    }

    SDK_ISR_EXIT_BARRIER;
}

static void Scan_I2C_Devices(I3C_Type *base)
{
    uint8_t dummyData = 0x00;
    status_t result;

    PRINTF("[I2C]Scanning I2C addresses...\n");

    for (uint8_t addr = 0x08; addr <= 0x77; addr++) // I2C valid 7-bit address range
    {
        result = BOARD_I3C_Send(base, addr, 0x00, 0, &dummyData, 0);

        if (result == kStatus_Success)
        {
        	PRINTF("[I2C]Device found at 0x%02X\n", addr);
        }
    }

    PRINTF("[I2C]Scan complete.\n");
}


/*! @brief Main function */
int main(void)
{

    /* Init board hardware. */
    BOARD_InitHardware();
    PRINTF("-------------- PCA9422 BOARD_InitHardware OK--------------\r\n");

    /* Define the init structure for the input switch pin */
    gpio_pin_config_t sw_config    = {kGPIO_DigitalInput, 0};
    gpio_interrupt_config_t config = {kGPIO_PinIntEnableEdge, kGPIO_PinIntEnableLowOrFall};
    /* Init input switch GPIO. */
    EnableIRQ(GPIO_INTA_IRQn);
#if TOUCH_ENABLE
    GPIO_PortInit(GPIO, PIO0_28_PORT);
    GPIO_PinInit(GPIO, PIO0_28_PORT, PIO0_28_PIN, &sw_config);
    /* Enable GPIO pin interrupt */
    GPIO_SetPinInterruptConfig(GPIO, PIO0_28_PORT, PIO0_28_PIN, &config);
    GPIO_PinEnableInterrupt(GPIO, PIO0_28_PORT, PIO0_28_PIN, kGPIO_InterruptA);
#endif

#if PMIC_GLF70583_ENABLE
    /* Init GPIO */
    GPIO_PortInit(GPIO, PWR_SW1_PORT);
    gpio_pin_config_t output_int_config = {kGPIO_DigitalOutput, 0,};
    GPIO_PinInit(GPIO, PWR_SW1_PORT, PWR_SW1_PIN, &output_int_config);
    GPIO_PinWrite(GPIO, PWR_SW1_PORT, PWR_SW1_PIN, 0);
#endif

#if CHARGER_ENABLE
    GPIO_PortInit(GPIO, PIO0_29_PORT);
    GPIO_PinInit(GPIO, PIO0_29_PORT, PIO0_29_PIN, &sw_config);
    /* Enable GPIO pin interrupt */
    GPIO_SetPinInterruptConfig(GPIO, PIO0_29_PORT, PIO0_29_PIN, &config);
    GPIO_PinEnableInterrupt(GPIO, PIO0_29_PORT, PIO0_29_PIN, kGPIO_InterruptA);
#endif


#if AMP_ENABLE
    gpio_pin_config_t amp_config = {
            kGPIO_DigitalOutput,
            1,
        };
    GPIO_PortInit(GPIO, 1);
    GPIO_PinInit(GPIO, 1, 0, &amp_config);
#endif

    BOARD_I3C_Init(BOARD_PMIC_I3C_BASEADDR, BOARD_PMIC_I3C_CLOCK_FREQ);
    Scan_I2C_Devices(BOARD_PMIC_I3C_BASEADDR);

#if PMIC_PCA9422_ENABLE
   /* Init PCA9422 PMIC. */
	BOARD_InitPmic();
	PRINTF("-------------- PCA9422 BOARD_InitPmic OK--------------\r\n");
	/* Apply PMIC mode and voltage settings */
	BOARD_Init_PMICConfigure();
	PRINTF("-------------- PCA9422 BOARD_Init_PMICConfigure OK--------------\r\n");
#endif

#if PMIC_GLF70583_ENABLE

	uint8_t top_stat = 0;
	glf70583_i2c_read(GLF70583_A_I2C_ADDR,0x00,&top_stat,1);
	PRINTF("[GLF70583]top_stat:%X \n",top_stat);

	//Solution: The manufacturer did not set it to LOAD SWITCH
	glf70583_i2c_write(GLF70583_A_I2C_ADDR,0xF5, 0xC6);
	glf70583_i2c_write(GLF70583_A_I2C_ADDR,0x24, 0xB8);
	SDK_DelayAtLeastUs(10000, CLOCK_GetFreq(kCLOCK_CoreSysClk));//delay 10ms
	glf70583_i2c_write(GLF70583_A_I2C_ADDR,0x24, 0xB9);

	// BUCK1 Delay 4ms
	glf70583_i2c_write(GLF70583_A_I2C_ADDR,0x66, 0x0C);
	// BUCK2 Delay 2ms
	glf70583_i2c_write(GLF70583_A_I2C_ADDR, 0x67, 0x08);
	glf70583_i2c_write(GLF70583_B_I2C_ADDR, 0x67, 0x08);
	// BUCK3 Delay 0ms
	glf70583_i2c_write(GLF70583_A_I2C_ADDR, 0x68, 0x00);
	// LDO1 Delay 5ms
	glf70583_i2c_write(GLF70583_A_I2C_ADDR, 0x6A, 0x12);
	// 0x25->BUCK4、LDO2 off
	glf70583_i2c_write(GLF70583_A_I2C_ADDR, 0x26, 0xE8);
	// 0x26->BUCK2 ON、Others off
	glf70583_i2c_write(GLF70583_B_I2C_ADDR, 0x26, 0x40);

	//uint8_t ch = GETCHAR();
	PRINTF("GPIO_PinWrite(GPIO, PWR_SW1_PORT, PWR_SW1_PIN, 1); \n");
	GPIO_PinWrite(GPIO, PWR_SW1_PORT, PWR_SW1_PIN, 1); //Enable GLF70583

#endif

#if AMP_ENABLE

	PRINTF("[AMP][AW88166] \r\n");

	init_aw88166();

	PRINTF("[I2S]Configure I2S \r\n");

    I2S_TxGetDefaultConfig(&s_TxConfig);

    // I2S 32bits
    s_TxConfig.dataLength  = 32;
    s_TxConfig.frameLength = 64;
    s_TxConfig.divider     = (24576000U / 16000U / 32U / 2);//DEMO_I2S_CLOCK_DIVIDER;
    s_TxConfig.masterSlave = DEMO_I2S_TX_MODE;

    I2S_TxInit(DEMO_I2S_TX, &s_TxConfig);

    DMA_Init(DEMO_DMA);

    DMA_EnableChannel(DEMO_DMA, DEMO_I2S_TX_CHANNEL);
    DMA_SetChannelPriority(DEMO_DMA, DEMO_I2S_TX_CHANNEL, kDMA_ChannelPriority3);
    DMA_CreateHandle(&s_DmaTxHandle, DEMO_DMA, DEMO_I2S_TX_CHANNEL);

    StartSoundPlayback();

#endif

#if LED_ENABLE
	/* LED Init */
	ktd202x_probe();

	ktd202x_ch1_led_on(1); //blue
	ktd202x_ch2_led_on(1); //red
	ktd202x_ch3_led_on(1);//green
#endif

#if CHARGER_ENABLE

	uint8_t ch_st,ID;

	bq256xx_read_reg(BQ256XX_REG_PART_INFO,&ID,1);
	PRINTF("BQ25618 ID:(0x%02X)\n",ID);

    // 設定充電器參數
    bq256xx_cfg_t charger_cfg = {
        .vindpm_uv = 4500000,
        .iindpm_ua = 2400000,
        .ichg_ua = 2040000,
        .vbatreg_uv = 4208000,
        .iprechg_ua = 180000,
        .iterm_ua = 180000,
        .wdt_ms = 0  // 禁用 Watchdog
    };

    if (bq256xx_init(&charger_cfg) != kStatus_Success) {
        PRINTF("BQ256xx init failed!\n");
        return -1;
    }
    else{
        PRINTF("BQ256xx initialized.OK \n");
    }

#endif

#if TOUCH_ENABLE

	uint16_t fw_version = 0;
	int ret = elan_touch_get_fw_version(&fw_version);

    if (ret == 0) {
        PRINTF("Elan Touch FW Version: 0x%04X\n", fw_version);
    } else {
        PRINTF("Failed to get FW version, error code: %d\n", ret);
    }

    const uint8_t data_reg = 0xC0;
    uint8_t buf[EWD_FRAME_MAX_LEN];

#endif

    while(1)
    {
#if AMP_ENABLE
    	uint8_t ch = GETCHAR();
    	if(ch==0x11)
    	{
    		StopSoundPlayback();
    	}
    	else if (ch==0x22){
    		StartSoundPlayback();
    	}
#endif
#if CHARGER_ENABLE
    	if(g_PIO0_29_Flag )
    	{
    		g_PIO0_29_Flag = false;

			// 輪詢充電狀態
			bq256xx_status_t status;
			if (bq256xx_poll_status(&status) == kStatus_Success) {
				PRINTF("Power Good: %s\n", status.power_good ? "Yes" : "No");
				PRINTF("VBUS Status: 0x%02X\n", status.vbus_stat);
				PRINTF("Charge Status: 0x%02X\n", status.chg_stat);
				PRINTF("Fault Status: 0x%02X\n", status.fault_stat);
				PRINTF("VBUS Good: %s\n", status.vbus_good ? "Yes" : "No");
				PRINTF("\n");
			} else {
				PRINTF("Failed to read charger status.\n");
			}
			GPIO_PinEnableInterrupt(GPIO, PIO0_29_PORT, PIO0_29_PIN, kGPIO_InterruptA);
		}
#endif

#if TOUCH_ENABLE
    	if(g_PIO0_28_Flag )
    	{
    		g_PIO0_28_Flag = false;  // 清除旗標以避免重複處理

    		int rc = hal_i2c_mem_read_impl(EKTF_I2C_ADDR_7BIT, data_reg, buf, EWD_FRAME_MAX_LEN);

            if (rc == 0) {
                elan_parse_and_report_data(buf, EWD_FRAME_MAX_LEN);
            }

            // 資料處理完畢後，重新啟用中斷
            GPIO_PinEnableInterrupt(GPIO, PIO0_28_PORT, PIO0_28_PIN, kGPIO_InterruptA);
    	}
#endif
    }


}

